import React from 'react';

let UserUtils = (() => {

    let banks = [{"value": "国家开发银行", "label": "国家开发银行"}, {"value": "中国工商银行", "label": "中国工商银行"}, {
        "value": "中国农业银行",
        "label": "中国农业银行"
    }, {"value": "中国银行", "label": "中国银行"}, {"value": "中国建设银行", "label": "中国建设银行"}, {
        "value": "中国邮政储蓄银行",
        "label": "中国邮政储蓄银行"
    }, {"value": "交通银行", "label": "交通银行"}, {"value": "招商银行", "label": "招商银行"}, {
        "value": "上海浦东发展银行",
        "label": "上海浦东发展银行"
    }, {"value": "兴业银行", "label": "兴业银行"}, {"value": "华夏银行", "label": "华夏银行"}, {
        "value": "广东发展银行",
        "label": "广东发展银行"
    }, {"value": "中国民生银行", "label": "中国民生银行"}, {"value": "中信银行", "label": "中信银行"}, {
        "value": "中国光大银行",
        "label": "中国光大银行"
    }, {"value": "恒丰银行", "label": "恒丰银行"}, {"value": "浙商银行", "label": "浙商银行"}, {
        "value": "渤海银行",
        "label": "渤海银行"
    }, {"value": "平安银行", "label": "平安银行"}, {"value": "上海农村商业银行", "label": "上海农村商业银行"}, {
        "value": "玉溪市商业银行",
        "label": "玉溪市商业银行"
    }, {"value": "尧都农商行", "label": "尧都农商行"}, {"value": "北京银行", "label": "北京银行"}, {
        "value": "上海银行",
        "label": "上海银行"
    }, {"value": "江苏银行", "label": "江苏银行"}, {"value": "杭州银行", "label": "杭州银行"}, {
        "value": "南京银行",
        "label": "南京银行"
    }, {"value": "宁波银行", "label": "宁波银行"}, {"value": "徽商银行", "label": "徽商银行"}, {
        "value": "长沙银行",
        "label": "长沙银行"
    }, {"value": "成都银行", "label": "成都银行"}, {"value": "重庆银行", "label": "重庆银行"}, {
        "value": "大连银行",
        "label": "大连银行"
    }, {"value": "南昌银行", "label": "南昌银行"}, {"value": "福建海峡银行", "label": "福建海峡银行"}, {
        "value": "汉口银行",
        "label": "汉口银行"
    }, {"value": "温州银行", "label": "温州银行"}, {"value": "青岛银行", "label": "青岛银行"}, {
        "value": "台州银行",
        "label": "台州银行"
    }, {"value": "嘉兴银行", "label": "嘉兴银行"}, {"value": "常熟农村商业银行", "label": "常熟农村商业银行"}, {
        "value": "南海农村信用联社",
        "label": "南海农村信用联社"
    }, {"value": "常州农村信用联社", "label": "常州农村信用联社"}, {"value": "内蒙古银行", "label": "内蒙古银行"}, {
        "value": "绍兴银行",
        "label": "绍兴银行"
    }, {"value": "顺德农商银行", "label": "顺德农商银行"}, {"value": "吴江农商银行", "label": "吴江农商银行"}, {
        "value": "齐商银行",
        "label": "齐商银行"
    }, {"value": "贵阳市商业银行", "label": "贵阳市商业银行"}, {"value": "遵义市商业银行", "label": "遵义市商业银行"}, {
        "value": "湖州市商业银行",
        "label": "湖州市商业银行"
    }, {"value": "龙江银行", "label": "龙江银行"}, {"value": "晋城银行JCBANK", "label": "晋城银行JCBANK"}, {
        "value": "浙江泰隆商业银行",
        "label": "浙江泰隆商业银行"
    }, {"value": "广东省农村信用社联合社", "label": "广东省农村信用社联合社"}, {
        "value": "东莞农村商业银行",
        "label": "东莞农村商业银行"
    }, {"value": "浙江民泰商业银行", "label": "浙江民泰商业银行"}, {"value": "广州银行", "label": "广州银行"}, {
        "value": "辽阳市商业银行",
        "label": "辽阳市商业银行"
    }, {"value": "江苏省农村信用联合社", "label": "江苏省农村信用联合社"}, {"value": "廊坊银行", "label": "廊坊银行"}, {
        "value": "浙江稠州商业银行",
        "label": "浙江稠州商业银行"
    }, {"value": "德阳商业银行", "label": "德阳商业银行"}, {"value": "晋中市商业银行", "label": "晋中市商业银行"}, {
        "value": "苏州银行",
        "label": "苏州银行"
    }, {"value": "桂林银行", "label": "桂林银行"}, {"value": "乌鲁木齐市商业银行", "label": "乌鲁木齐市商业银行"}, {
        "value": "成都农商银行",
        "label": "成都农商银行"
    }, {"value": "张家港农村商业银行", "label": "张家港农村商业银行"}, {"value": "东莞银行", "label": "东莞银行"}, {
        "value": "莱商银行",
        "label": "莱商银行"
    }, {"value": "北京农村商业银行", "label": "北京农村商业银行"}, {"value": "天津农商银行", "label": "天津农商银行"}, {
        "value": "上饶银行",
        "label": "上饶银行"
    }, {"value": "富滇银行", "label": "富滇银行"}, {"value": "重庆农村商业银行", "label": "重庆农村商业银行"}, {
        "value": "鞍山银行",
        "label": "鞍山银行"
    }, {"value": "宁夏银行", "label": "宁夏银行"}, {"value": "河北银行", "label": "河北银行"}, {
        "value": "华融湘江银行",
        "label": "华融湘江银行"
    }, {"value": "自贡市商业银行", "label": "自贡市商业银行"}, {"value": "云南省农村信用社", "label": "云南省农村信用社"}, {
        "value": "吉林银行",
        "label": "吉林银行"
    }, {"value": "东营市商业银行", "label": "东营市商业银行"}, {"value": "昆仑银行", "label": "昆仑银行"}, {
        "value": "鄂尔多斯银行",
        "label": "鄂尔多斯银行"
    }, {"value": "邢台银行", "label": "邢台银行"}, {"value": "晋商银行", "label": "晋商银行"}, {
        "value": "天津银行",
        "label": "天津银行"
    }, {"value": "营口银行", "label": "营口银行"}, {"value": "吉林农信", "label": "吉林农信"}, {
        "value": "山东农信",
        "label": "山东农信"
    }, {"value": "西安银行", "label": "西安银行"}, {"value": "河北省农村信用社", "label": "河北省农村信用社"}, {
        "value": "宁夏黄河农村商业银行",
        "label": "宁夏黄河农村商业银行"
    }, {"value": "贵州省农村信用社", "label": "贵州省农村信用社"}, {"value": "阜新银行", "label": "阜新银行"}, {
        "value": "湖北银行黄石分行",
        "label": "湖北银行黄石分行"
    }, {"value": "浙江省农村信用社联合社", "label": "浙江省农村信用社联合社"}, {"value": "新乡银行", "label": "新乡银行"}, {
        "value": "湖北银行宜昌分行",
        "label": "湖北银行宜昌分行"
    }, {"value": "乐山市商业银行", "label": "乐山市商业银行"}, {"value": "江苏太仓农村商业银行", "label": "江苏太仓农村商业银行"}, {
        "value": "驻马店银行",
        "label": "驻马店银行"
    }, {"value": "赣州银行", "label": "赣州银行"}, {"value": "无锡农村商业银行", "label": "无锡农村商业银行"}, {
        "value": "广西北部湾银行",
        "label": "广西北部湾银行"
    }, {"value": "广州农商银行", "label": "广州农商银行"}, {"value": "江苏江阴农村商业银行", "label": "江苏江阴农村商业银行"}, {
        "value": "平顶山银行",
        "label": "平顶山银行"
    }, {"value": "泰安市商业银行", "label": "泰安市商业银行"}, {"value": "南充市商业银行", "label": "南充市商业银行"}, {
        "value": "重庆三峡银行",
        "label": "重庆三峡银行"
    }, {"value": "中山小榄村镇银行", "label": "中山小榄村镇银行"}, {"value": "邯郸银行", "label": "邯郸银行"}, {
        "value": "库尔勒市商业银行",
        "label": "库尔勒市商业银行"
    }, {"value": "锦州银行", "label": "锦州银行"}, {"value": "齐鲁银行", "label": "齐鲁银行"}, {
        "value": "青海银行",
        "label": "青海银行"
    }, {"value": "阳泉银行", "label": "阳泉银行"}, {"value": "盛京银行", "label": "盛京银行"}, {
        "value": "抚顺银行",
        "label": "抚顺银行"
    }, {"value": "郑州银行", "label": "郑州银行"}, {"value": "深圳农村商业银行", "label": "深圳农村商业银行"}, {
        "value": "潍坊银行",
        "label": "潍坊银行"
    }, {"value": "九江银行", "label": "九江银行"}, {"value": "江西省农村信用", "label": "江西省农村信用"}, {
        "value": "河南省农村信用",
        "label": "河南省农村信用"
    }, {"value": "甘肃省农村信用", "label": "甘肃省农村信用"}, {"value": "四川省农村信用", "label": "四川省农村信用"}, {
        "value": "广西省农村信用",
        "label": "广西省农村信用"
    }, {"value": "陕西信合", "label": "陕西信合"}, {"value": "武汉农村商业银行", "label": "武汉农村商业银行"}, {
        "value": "宜宾市商业银行",
        "label": "宜宾市商业银行"
    }, {"value": "昆山农村商业银行", "label": "昆山农村商业银行"}, {"value": "石嘴山银行", "label": "石嘴山银行"}, {
        "value": "衡水银行",
        "label": "衡水银行"
    }, {"value": "信阳银行", "label": "信阳银行"}, {"value": "鄞州银行", "label": "鄞州银行"}, {
        "value": "张家口市商业银行",
        "label": "张家口市商业银行"
    }, {"value": "许昌银行", "label": "许昌银行"}, {"value": "济宁银行", "label": "济宁银行"}, {
        "value": "开封市商业银行",
        "label": "开封市商业银行"
    }, {"value": "威海市商业银行", "label": "威海市商业银行"}, {"value": "湖北银行", "label": "湖北银行"}, {
        "value": "承德银行",
        "label": "承德银行"
    }, {"value": "丹东银行", "label": "丹东银行"}, {"value": "金华银行", "label": "金华银行"}, {
        "value": "朝阳银行",
        "label": "朝阳银行"
    }, {"value": "临商银行", "label": "临商银行"}, {"value": "包商银行", "label": "包商银行"}, {
        "value": "兰州银行",
        "label": "兰州银行"
    }, {"value": "周口银行", "label": "周口银行"}, {"value": "德州银行", "label": "德州银行"}, {
        "value": "三门峡银行",
        "label": "三门峡银行"
    }, {"value": "安阳银行", "label": "安阳银行"}, {"value": "安徽省农村信用社", "label": "安徽省农村信用社"}, {
        "value": "湖北省农村信用社",
        "label": "湖北省农村信用社"
    }, {"value": "湖南省农村信用社", "label": "湖南省农村信用社"}, {"value": "广东南粤银行", "label": "广东南粤银行"}, {
        "value": "洛阳银行",
        "label": "洛阳银行"
    }, {"value": "农信银清算中心", "label": "农信银清算中心"}, {"value": "城市商业银行资金清算中心", "label": "城市商业银行资金清算中心"}];

    return {banks}

})();

export default UserUtils;